<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Synology Hyper Backup Explorer DMG and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.jacobfgrant.munki.SynologyHyperBackupExplorer</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SynologyHyperBackupExplorer</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Synology</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>A desktop tool for browsing, decrypting, and extracting different versions of backup data in Hyper Backup repositories.</string>
            <key>display_name</key>
            <string>Synology Hyper Backup Explorer</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jacobfgrant.download.SynologyHyperBackupExplorer</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
