<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Nextcloud Mac client pkg.</string>
    <key>Identifier</key>
    <string>com.github.jacobfgrant.download.Nextcloud</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Nextcloud</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>https://download.nextcloud.com/desktop/releases/Mac/Installer/Nextcloud-([1-9][\.0-9]*)\.pkg</string>
                <key>result_output_var_name</key>
                <string>nextcloud_version</string>
                <key>url</key>
                <string>https://nextcloud.com/install/#install-clients</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://download.nextcloud.com/desktop/releases/Mac/Installer/Nextcloud-%nextcloud_version%.pkg</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Nextcloud*.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Nextcloud GmbH (NKUJUXUJ3B)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
