<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Money.Net installer DMG and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.jacobfgrant.munki.MoneyNet</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MoneyNet</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/other/moneynet</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Other</string>
            <key>description</key>
            <string>Money.Net is a platform that empowers you to analyze and monitor markets in real-time by providing you with professional level market information and tools. Money.Net provides real-time US equity prices, options, international equities, foreign exchange, bond and commodity futures. Money.Net also includes a professional technical charting system, the fastest live breaking market news, an Excel API to update your spreadsheets with live feeds and updatable historical data, graphical market analytics, and much more, all in one place.</string>
            <key>developer</key>
            <string>Money.Net</string>
            <key>display_name</key>
            <string>Money.Net</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jacobfgrant.download.MoneyNet</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
