<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Flux and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.jacobfgrant.munki.Flux</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Flux</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/system/flux</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>System</string>
            <key>description</key>
            <string>f.lux makes the color of your computer's display adapt to the time of day, warm at night and like sunlight during the day.</string>
            <key>developer</key>
            <string>Flux</string>
            <key>display_name</key>
            <string>f.lux</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jacobfgrant.download.Flux</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
