<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest XMind DMG and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.jacobfgrant.munki.XMind</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>XMind</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/office/xmind</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Office</string>
            <key>description</key>
            <string>XMind is a cool mind-mapping utility.</string>
            <key>developer</key>
            <string>XMind</string>
            <key>display_name</key>
            <string>XMind</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jacobfgrant.download.XMind</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
