<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest XMind DMG.</string>
    <key>Identifier</key>
    <string>com.github.jacobfgrant.download.XMind</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>XMind</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>xmind-([0-9\.]*)-macosx.dmg</string>
                <key>result_output_var_name</key>
                <string>xmind_version</string>
                <key>url</key>
                <string>http://www.xmind.net/download/mac/</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.xmind.net/xmind/downloads/xmind-%xmind_version%-macosx.dmg</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
